# Используем легкий официальный образ Python в качестве основы
FROM python:3.9-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями в рабочую директорию
COPY requirements.txt .

# Устанавливаем все библиотеки из requirements.txt
RUN pip install -r requirements.txt

# Копируем все файлы из нашей локальной папки "app" внутрь контейнера в рабочую директорию "/app"
COPY ./app .

# Команда, которая будет запускаться при старте контейнера
# Запускаем веб-сервер uvicorn, указываем ему на наше приложение (main:app)
# --host 0.0.0.0 - слушать все входящие подключения
# --port 80 - работать на 80-м порту внутри контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "80"]